app/Http/Controllers/ScheduleController.php

            }
        }

        $findModes3 = Mode:: where('start_mode','>=', $firstDayOfMonth)->
                            where('end_mode','>', $lastDayOfMonth)->get();
---
select * from "modes" where "start_mode" <= '2021-01-31 00:00:00' and "end_mode" >= '2021-01-01 00:00:00'

                $i = date_create($findMode3->start_mode);
                $k = $lastDayOfMonth;
                for ($i; $i<=$k; $i=date_add($i, date_interval_create_from_date_string("1 day"))) {
                    $findSchedule3=Schedule::where('worker_id', $findMode3->worker_id)->
                                             where('day_of_month', $i)->
                                             where('mode_code_id', $findMode3->mode_code_id)->first();
---
select * from "schedules" where "worker_id" = 9 and "day_of_month" = '2021-01-12 00:00:00' and "mode_code_id" = 8 limit 1

                        $schedule->worker_id = $findMode3->worker_id;
                        $schedule->day_of_month = $i;
                        $schedule->mode_code_id = $findMode3->mode_code_id;
                        $schedule->save();
---
insert into "schedules" ("worker_id", "day_of_month", "mode_code_id", "updated_at", "created_at") values (9, '2021-01-12 00:00:00', 8, '2021-02-17 15:04:24', '2021-02-17 15:04:24') returning "id"

            }
        }

        $findModes4 = Mode:: where('start_mode','<', $firstDayOfMonth)->
                            where('end_mode','>', $lastDayOfMonth)->get();
---
select * from "modes" where "start_mode" <= '2021-01-31 00:00:00' and "end_mode" >= '2021-01-01 00:00:00'

                $i = $firstDayOfMonth;
                $k = $lastDayOfMonth;
                for ($i; $i<=$k; $i=date_add($i, date_interval_create_from_date_string("1 day"))) {
                    $findSchedule4=Schedule::where('worker_id', $findMode->worker_id)->
                                             where('day_of_month', $i)->
                                             where('mode_code_id', $findMode->mode_code_id)->first();
---
select * from "schedules" where "worker_id" = 9 and "day_of_month" = '2021-01-12 00:00:00' and "mode_code_id" = 8 limit 1

                        $schedule->worker_id = $findMode->worker_id;
                        $schedule->day_of_month = $i;
                        $schedule->mode_code_id = $findMode->mode_code_id;
                        $schedule->save();
---
insert into "schedules" ("worker_id", "day_of_month", "mode_code_id", "updated_at", "created_at") values (9, '2021-01-01 00:00:00', 1, '2021-02-17 15:04:29', '2021-02-17 15:04:29') returning "id"