app/Http/Controllers/WorkerController.php

    public function showAll(){
        $workers=Worker::all();
---
select * from "workers" where "workers"."deleted_at" is null